export const arabicMonths: string[] = [
  "يناير",
  "فبراير",
  "مارس",
  "أبريل",
  "مايو",
  "يونيو",
  "يوليو",
  "أغسطس",
  "سبتمبر",
  "أكتوبر",
  "نوفمبر",
  "ديسمبر",
];

export const TIME_SLOTS = [
  "09:00 AM",
  "10:00 AM",
  "11:00 AM",
  "12:00 PM",
  "01:00 PM",
  "02:00 PM",
  "03:00 PM",
  "04:00 PM",
];

export const days: string[] = [
  "الاحد",
  "الاثنين",
  "الثلاثاء",
  "الاربعاء",
  "الخميس",
  "الجمعة",
  "السبت",
];

export const TIME_SLOT_TEXTS: { [key: string]: string } = {
  "09:00 AM": "على الساعة التاسعة صباحا",
  "10:00 AM": "على الساعة العاشرة صباحا",
  "11:00 AM": "على الساعة الحادية عشرة صباحا",
  "12:00 PM": "على الساعة الثانية عشرة ظهراً",
  "01:00 PM": "على الساعة الواحدة ظهراً",
  "02:00 PM": "على الساعة الثانية مساءً",
  "03:00 PM": "على الساعة الثالثة مساءً",
  "04:00 PM": "على الساعة الرابعة مساءً",
};
